Revit 2026 API

# PointCloudTypeGetReCapProject Method

---

This method provides a direct entry point to get access to an object from the ReCap SDK (ReCapWrapper.RCProject) from Revit. This object represents the point cloud from the RC file path stored in PointCloudType. The ReCap assembly AdskRcManaged.dll will need to be included into code using this method.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RCProject GetReCapProject()
```
```vb
Public Function GetReCapProject As RCProject
```
```cpp
public:
RCProject^ GetReCapProject()
```
```fsharp
member GetReCapProject : unit -> RCProject
```

#### Return Value

RCProject

| Exception | Condition |
| --- | --- |
| FileAccessException | The file or PointCloudEngine is not ReCap based. |
| InvalidOperationException | Exception happens when ReCap loading the project. |

The coordinate system in RCProject is defined by Point Cloud. Please refer to ReCap SDK document for RCProject::getCoordinateSystem. If you need points converted to the modeling coordinate system in Revit, you can obtain the transformation matrix from PointCloudInstance GetTransform.

#### Reference

PointCloudType Class

Autodesk.Revit.DB Namespace